# -*- coding: utf-8 -*-
"""Story config.
"""

################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("sana", "沙奈", "一宮,沙奈", 25, (9,15), "female", "編集者", "me:私:gero:弥生:azu:三喜:a_tsuchi:ツッチー"),# 愛知県
        ("noto", "能登川", "能登川,修", 42, (6,14), "male", "作家", "me:僕:sana:一宮:a_chiyo:お千代"),# 石川県
        ## 出版社
        ("king", "大井", "大井,景勝", 50, (1,1), "male", "編集長", "me:俺", "あだ名は「王」"),# 神奈川県
        ("fukaya", "深谷", "深谷,英里", 35, (10,1), "female", "編集者", "me:わたし:a_sana:一宮"),# 埼玉県
        ("nirasaki", "韮崎", "韮崎,航大", 28, (1,1), "male", "編集者", "me:おれ:yone:ヨネ"),# 山梨県
        ("yonezawa", "米沢", "米沢,耕作", 40, (1,1), "male", "編集者", "me:僕"),# 山形県
        ("tsuchiura", "土浦", "土浦,大樹", 22, (1,1), "male", "編集部バイト", "me:オレ:sana:一宮"),# 茨城県
        ## 能登川関連
        ("tsuru", "敦賀", "敦賀,由紀夫", 42, (1,1), "male", "故人（作家見習い）", "me:オレ"),# 福井県／金閣寺の鶴田
        ("asahi", "朝日", "朝日,洋子", 42, (5,10), "female", "飲み屋", "me:アタシ"),# 富山県
        ("komi", "香美", "新村,香美", 42, (7,7), "female", "故人（学生）", "me:私"),# 兵庫県
        ("tamayo", "珠代", "能登川,珠代", 67,(1,1), "female", "母", "me:わたし"),
        ("hiroshi", "広志", "能登川,広志", 68,(1,1), "male", "父", "me:俺"),
        ## 沙奈関連
        ("gero", "下呂", "下呂,弥生", 19, (5,10), "female", "絵描き", "me:ワシ"),# 岐阜県
        ("azumino", "安曇野", "安曇野,三喜", 25, (1,10), "female", "作家見習い", "me:わたし"),# 長野県
        ("owase", "尾鷲", "尾鷲,孝之", 26, (7,1), "male", "作家志望", "me:オレ"),# 三重県
        ## 沙奈関連（家族）
        ("ken", "健一", "一宮,健一", 26, (11,5), "male", "会社員", "me:俺"),# 沙奈の兄
        ## 創作関連
        ("nose", "野迫川", "野迫川,卓斗", 35, (1,1), "male", "作家", "me:ボク"),# 奈良県　盗作作家
        ("nomio", "ノミオ", "川中,ノミオ", 40, (1,1), "male", "人気作家", "me:ワシ"),# 山口県　人気作家、美少女ゲーム出身
        ("nisino", "西野", "西野成悟", 40, (1,1), "male", "ベストセラー作家", "me:僕"),# 東野圭吾
        ("ayabe", "綾部", "綾部,みさき", 45, (1,1), "female", "ベストセラー作家", "me:私"),# 宮部みゆき
        ("katsuragi", "葛城", "葛城,一馬", 35, (1,1),"male", "ライトノベル作家","me:俺"),
        ("linlin", "倫", "倫,凛麟", 27,(1,1), "male", "ライトノベル作家", "me:オレ"),
        ("aera", "亜江羅", "亜江羅吉樹", 50,(1,1),"male", "ライトノベル作家","me:私"),
        ("denbu", "電歩", "尻元,電歩", 22, (1,1), "female", "ライトノベル作家", "me:わたし"),
        ## 雑誌関連
        ("yuzawa", "湯沢", "湯沢,雅俊", 40, (6,25), "male", "記者", "me:俺"),# 新潟県　記者
        ## 編集プロ
        ("goto", "五島", "五島,風美", 40, (8,17), "female", "編集長", "me:私"),# 長崎県　前の会社の編集長
        ## 印刷所
        ("oki", "隠岐", "隠岐,秀伍", 30, (1,1), "male", "印刷所社員", "me:私"),# 島根県
        ## 飲食店関連
        ("chiyoda", "千代田", "千代田,風美", 50, (1,1), "female", "喫茶店", "me:あたし"),# 群馬県　喫茶店
        ("utsu", "宇都宮", "宇都宮,薫", 65, (1,1), "male", "バーテン", "me:私"),# 栃木県　バー
        ("hanamaki", "花巻", "花巻,由加里", 55, (1,1), "female", "洋食屋", "me:わたし"),# 岩手県　潰れる洋食屋
        ## 旅館
        ("momo", "桃島", "桃島,富", 45, (1,1), "female", "中居", "me:わたし"),
        ("takeno", "竹野", "竹野,夕子", 65, (1,1), "female", "女将", "me:私"),
        ## その他
        ("rin", "輪", "輪,天亥", 25, (1,1), "male", "コンビニ店員", "me:ワタシ"),# コンビニ店員
        ## 動物
        ("mascat", "マダナイ", "", 10, (1,1), "female", "猫", "me:吾輩"),
        ## モブ
        ("trainman", "車掌", "", 40, (1,1), "male", "車掌", "me:私"),
        ("newwriter", "新しい作家", "", 25 ,(1,1), "male", "ラノベ作家", "me:ぼく"),
        ("police", "警官", "", 30, (1,1), "male", "警察官", "me:私"),
        ("rideman", "乗客", "", 30,(1,1), "male", "乗客", "me:私"),
        ("oldlady", "老婆", "", 70,(1,1), "female", "一般人", "me:私"),
        )

AREAS = (
        # Tag / 名前 / x,y / 備考
        ("Tokyo", "東京都", 100,100),
        ("Nerima", "練馬区", 90,120, "東京23区の一つ"),
        ("Nakano", "中野区", 100,110, "東京23区の一つ。アリス出版がある"),
        ("Mitaka", "三鷹市", 100,120, "多くの著名な作家が暮らした街として有名"),
        ("Bunkyo", "文京区", 110, 120, "東京23区の一つ。大手企業の本社が多い"),
        ("Shinjuku", "新宿区", 110,120, "東京23区の一つ"),
        ("Shibuya", "渋谷区", 110,110, "東京23区の一つ"),
        ("Chiyoda", "千代田区", 120,110, "東京23区の一つ"),
        ("Kanazawa", "金沢市", 60,40, "先生の故郷"),
        ("Kinosaki", "城之崎", 40,50, "温泉街として有名な街"),
        )

STAGES = (
        # Tag / 名前 / 紹介
        ## 共用
        ("artmuseum", "美術館"),
        ("cafe", "喫茶店"),
        ("famires", "ファミレス"),
        ("hospital", "病院"),
        ("meetingroom", "会議室"),
        ("parking", "駐車場"),
        ## 三鷹市
        ("sta-mitakadai", "三鷹台駅", "Mitaka", "先生のアパートの最寄り駅"),
        ("tamagawariver", "玉川上水", "Mitaka"),
        ("inokashirapark", "井の頭公園", "Mitaka"),
        ("hisapart", "虞美人荘", "Mitaka", "先生のアパート"),
        ("hisnewapart", "先生の新アパート", "Mitaka"),
        ("hiscemetery", "敦賀の墓地", "Mitaka"),
        ("masterbar", "先生いきつけのバー", "Mitaka"),
        ("mastercafe", "喫茶ブラン・ル・ノワール", "Mitaka", "行きつけの喫茶店"),
        ("masterrestaurant", "先生いきつけの洋食屋", "Mitaka"),
        ## 練馬区
        ("sta-kamishakujii", "上石神井駅", "Nerima", "沙奈たちのアパートの最寄り駅"),
        ("herhouse", "アミーゴ練馬", "Nerima", "沙奈たちのシェアハウス"),
        ("herroom", "沙奈の部屋", "Nerima"),
        ## 中野区
        ("sta-higashinakano", "東中野駅", "Nakano", "アリス出版の最寄り駅"),
        ("hercompany", "アリス出版", "Nakano", "沙奈の勤める会社。元々は児童書出版から始まった"),
        ("heroffice", "第二文芸部オフィス", "Nakano"),
        ("conveni1", "ＦＭマート", "", "駅近くのコンビニ。よく沙奈が利用する"),
        ## 文京区
        ("Kodansha", "王断社", "Bunkyo", "講談社がモデル。最大手の総合出版社"),
        ("hotelhall", "ホテルの大ホール", "Bunkyo"),
        ## 渋谷区
        ("Kawade", "山手書房", "Shibuya", "河出書房新社がモデル"),
        ## 新宿区
        ("bigprint", "帝都印刷", "Shinjuku"),
        ## 千代田区
        ("Shueisha", "双鋭社", "Chiyoda", "集英社がモデル"),
        ("Shogakkan", "孔岳館", "Chiyoda", "小学館がモデル"),
        ## 金沢
        ("hishome", "先生の実家", "Kanazawa"),
        ("hisroom", "先生の実家の自室", "Kanazawa"),
        ("oldfamires", "古いファミレス", "Kanazawa"),
        ("classroom", "教室"),
        ("sickroom", "病室"),
        ("funeralhall", "葬儀場"),
        ("fruitsshop", "村沢商店"),
        ("mastershop", "能登屋", "Kanazawa"),
        ## 城之崎
        ("oldinn", "異杜荘", "Kinosaki"),
        ("onsen", "温泉"),
        ("dream", "夢の中"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ## 共通
        ("dazaibirth", "太宰治の誕生日", 6,19, 1909),
        ("dazaidead", "太宰治の命日", 6,13, 1948),
        ## 当時
        ("master_jrschool", "先生の中学時代", 4,1, 1989),# 中２
        ("master_highschool", "先生の高校時代", 4,1, 1992),# 高２
        ("komi_sick", "香美の入院", 10,13, 1992),
        ("visithospital", "香美の見舞い日", 10,31, 1992),
        ("master_graduatehigh", "高校卒業式", 3,10, 1994),
        ("komi_funeral", "香美の葬儀", 10,29, 1994),
        ("tsurudead", "敦賀が自殺した日", 6,13, 1997),
        ("writeletter", "告白の手紙を書いた日", 6,14, 2007),
        ## 現在
        ("firstmeet", "先生と初めて会った日", 10,13, 2017),# 友人の月命日で出かけていた
        ("secondmeet", "先生と二度目の面会日", 10,16, 2017),
        ("nogetpaper1", "原稿回収予定日その１", 10,20, 2017),
        ("nogetpaper2", "原稿回収予定日その２", 10,23, 2017),
        ("nogetpaper3", "原稿回収予定日その３", 10,25, 2017),
        ("deadline_short", "短編の原稿締切日", 10,30, 2017),
        ("meetingshortnovel", "短編掲載会議", 11,1, 2017),
        ### 実家編
        ("homevisit", "先生の実家に行った日", 1,2, 2018),
        ("back_kanazawa", "先生の実家から帰る日", 1,2, 2018),
        ("newparttimer", "新人バイトが会社に来た日", 1,9, 2018),
        ("newyearparty", "出版社の新年会", 1,13, 2018),
        ### 取材旅行編
        ("trip_kinosaki", "城之崎旅行", 1,20, 2018),
        ("backhome", "城之崎から戻ってきた日", 1,21, 2018),
        ### 後編
        ("thinknovel", "長編構想着手日", 2,12, 2018),
        ("visitgrave", "墓参りの日", 2,13, 2018),
        ("threaten1", "第一の脅迫状が来た日", 2,15, 2018),
        ("visitmuseum", "美術館に行った日", 2,17, 2018),
        ("threaten2", "第二の脅迫状が来た日", 2,25, 2018),
        ("stalking", "ストーカーされた日", 2,26, 2018),
        ("askplagiarism", "盗作のことを尋ねた日", 2,27, 2018),
        ("holidaywriting", "休日に執筆日", 2,28, 2018),
        ("firemaster", "先生のアパート火事", 3,1, 2018),
        ("nextfire", "火事の翌日", 3,2, 2018),
        ("aftergetletter", "手紙を手に入れた後日", 3,13, 2018),
        ("readletter", "先生の手紙を読んだ日", 3,13, 2018),
        ("vanishmaster", "先生の失踪日", 3,13, 2018),
        ("finishbook", "原稿が上がった日", 3,28, 2018),
        ("getfirstbook", "先生の製本された本を手に取る", 4,15, 2018),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        ("beforenoon", "昼前", 11,00),
        )

ITEMS = (
        # Tag / 名前 / 紹介
        ("masternote", "先生の創作ノート"),
        ("longpaper", "先生の長編原稿"),
        ("carryingpaper", "敦賀の持ち込み原稿"),
        ("willpaper", "敦賀の遺書"),
        ("sananote", "沙奈の創作ノート"),
        ## 小説
        ("masternovel1", "日陰のアネモネ", "文芸デビュー作"),
        ("masternovel2", "悠久のダンデライオン"),
        ("masternovel3", "懊悩のシンビジューム"),
        ("master_shortnovel1", "鬼斬りの乙女"),
        ("master_novel1", "鬼斬少女譚"),
        ("isesui", "異世界は衰退中です", "ノミオのベストセラー作品"),
        ("snovel1kari", "無限女王による世界再生記"),
        ("snovel1short", "異世界巫女と優しいドラゴン", "沙奈の短編小説"),
        ## 雑誌
        ("hermagazine1", "アリスマガジン"),
        ("magazine1_mihon", "アリスマガジン１月号見本"),
        ## 重要アイテム
        ("sparekey", "合鍵"),
        ("threatenletter1", "脅迫状"),
        ## 小道具
        ("manupaper", "原稿用紙"),
        ("weekmagazine1", "週刊サマーズ", "話題になる週刊誌（元ネタ文春）"),
        ("poster_isesui", "異世界は衰退中ですのポスター"),
        ## 舞台セット
        ### 一般
        ("sidewalk", "歩道"),
        ("planting", "植え込み"),
        ("air", "空気"),
        ### 小物
        ("calendar", "カレンダー"),
        ("shoulderbag", "肩掛け鞄"),
        ("bento", "弁当箱"),
        ("notebook", "手帳"),
        ### 食品
        ("warauiro", "蕨ういろう", "名古屋の銘菓。わらび餅とういろうの合わせ技"),
        ### 飲料
        ("winechile1", "ピノ・ノワール・ド・チリ", "チリ産のピノ・ノワール"),
        ("sake_sogen", "祝玄", "宗玄が元ネタ"),
        ### 雑貨
        ### 機器
        ("line", "ＬＩＮＥ"),
        ("twitter", "トイッター"),
        ("kindle", "ヨンドル"),
        ("sphone", "スマホ"),
        ("keitai", "携帯電話"),
        ("monitor", "モニタ"),
        ("mobilepc", "ノートパソコン"),
        ("tv", "テレビ"),
        ### 外
        )

WORDS = (
        # Tag / 名前 / 紹介
        ### アニメ
        ("onepeace", "ドラゴンピース", "ワンピース"),
        ("kimetsu", "殲滅の鬼刃", "鬼滅の刃、が元ネタのワンピースを抜いた大人気マンガ"),
        ("toulove", "剣戟愛撫", "刀剣乱舞が元ネタ"),
        ### 文庫
        ("dengeki", "伝説文庫", "電撃文庫が元ネタ。ラノベの大手レーベル"),
        ### 先生の言葉
        ("masterword001", "小説は必ず書き終えなければならない。それが喩え終わりのない物語であったとしてもね"),
        ### 小説関連
        ("alicecontest1", "アリスノベル新人賞"),
        ("isesui", "イセスイ"),
        ### 雑誌関連
        ("springgun", "サマーズ砲", "文春砲、のこと"),
        ### 敦賀
        ("deadtsuruyear", "一九九七年六月十三日"),
        )

RUBIS = (
        # Base / Rubi / Except / Type
        ("邪智暴虐", "｜邪智暴虐《じゃちぼうぎゃく》", ),
        ("戯れ", "｜戯《たわむ》れ", ),
        ("憤って", "｜憤《いきどお》って", ),
        ("煽られ","｜煽《あお》られ",),
        ("醜態","｜醜態《しゅうたい》",),
        ("晒して","｜晒《さら》して",),
        ("濁声", "｜濁声《だみごえ》",),
        ("抑揚","｜抑揚《よくよう》",),
        ("踵を", "｜踵《きびす》を",),
        ("髭", "｜髭《ひげ》",),
        ("罹患", "｜罹患《りかん》", ),
        ("罹る","｜罹《かか》る",),
        ("杞憂","｜杞憂《きゆう》",),
        ("蹲る","｜蹲《うずくま》る",),
        ("背中を擦る", "背中を｜擦《さす》る", ),
        ("顰め","｜顰《しか》め",),
        ("嘆く", "｜嘆《なげ》く",),
        ("虞美人荘", "｜虞美人荘《ぐびじんそう》",),
        ("瀕死","｜瀕死《ひんし》",),
        ("拘り", "｜拘《こだわ》り",),
        ("捲れ上がる","｜捲《めく》れ上がる",),
        ("所為","｜所為《せい》",),
        ("恰幅", "｜恰幅《かっぷく》"),
        ("寧ろ", "｜寧《むし》ろ"),
        ("憤り", "｜憤《いきどお》り"),
        ("膨らんで", "｜膨《ふく》らんで"),
        ("曇っ", "｜曇《くも》っ"),
        ("滲んで", "｜滲《にじ》んで"),
        ("滲む", "｜滲《にじ》む"),
        ("悪戯", "｜悪戯《いたずら》"),
        ("訊いて", "｜訊《き》いて"),
        ("蹲る", "｜蹲《うずくま》る"),
        ("嘆く", "｜嘆《なげ》く"),
        ("堪え", "｜堪《こら》え"),
        ("弄られる", "｜弄《いじ》られる"),
        ("曖昧", "｜曖昧《あいまい》"),
        ("足掻いて", "｜足掻《あが》いて"),
        ("貰って", "｜貰《もら》って"),
        ("錆び", "｜錆《さ》び"),
        ("瀕死", "｜瀕死《ひんし》"),
        ("蝉の", "｜蝉《せみ》の"),
        ("剥ぎ取り", "｜剥《は》ぎ取り"),
        ("微か", "｜微《かす》か"),
        ("呟いて", "｜呟《つぶや》いて"),
        ("太宰", "｜太宰《だざい》"),
        ("寓話的趣", "｜寓話的《ぐうわてき》｜趣《おもむき》"),
        ("顎", "｜顎《あご》"),
        ("撫で", "｜撫《な》で"),
        ("遮られ", "｜遮《さえぎ》られ"),
        ("睨み", "｜睨《にら》み"),
        ("微塵", "｜微塵《みじん》"),
        ("辱め", "｜辱《はずかし》め"),
        ("頑然と", "｜頑然《がんぜん》と"),
        ("悪戦苦闘", "｜悪戦苦闘《あくせんくとう》"),
        ("阿鼻叫喚", "｜阿鼻叫喚《あびきょうかん》"),
        ("前途多難", "｜前途多難《ぜんとたなん》"),
        ("密かに", "｜密《ひそ》かに"),
        ("捻じ曲げて", "｜捻《ね》じ曲げて"),
        ("耳障り", "｜耳障《みみざわ》り"),
        ("胡座", "｜胡座《あぐら》"),
        ("急遽", "｜急遽《きゅうきょ》"),
        ("訝る", "｜訝《いぶか》る"),
        ("唸り", "｜唸《うな》り"),
        ("濁る", "｜濁《にご》る"),
        ("野蛮", "｜野蛮《やばん》"),
        ("膝", "｜膝《ひざ》"),
        ("淹れ", "｜淹《い》れ"),
        ("仰い", "｜仰《おっしゃ》い"),
        ("諦める", "｜諦《あきら》める"),
        ("懐か", "｜懐《なつ》か"),
        ("僅か", "｜僅《わず》か"),
        ("随分", "｜随分《ずいぶん》"),
        ("窘める", "｜窘《たしな》める"),
        ("喚いて", "｜喚《わめ》いて"),
        ("吾輩は編集", "｜吾輩《わがはい》は編集"),
        ("獰悪", "｜獰悪《どうあく》"),
        ("噛み", "｜噛《か》み"),
        ("相槌", "｜相槌《あいづち》"),
        ("懐疑的", "｜懐疑的《かいぎてき》"),
        ("漏ら", "｜漏《も》ら"),
        ("柔和", "｜柔和《にゅうわ》"),
        ("見繕っ", "｜見繕《みつくろ》っ"),
        ("チーズ鱈", "チーズ｜鱈《たら》"),
        ("一揃い", "｜一揃《ひとそろ》い"),
        ("毟り", "｜毟《むし》り"),
        ("傍若無人", "｜傍若無人《ぼうじゃくぶじん》"),
        ("癪だ", "｜癪《しゃく》だ"),
        ("捉え", "｜捉《とら》え"),
        ("急須", "｜急須《きゅうす》"),
        ("脅し", "｜脅《おど》し"),
        ("啜る", "｜啜《すす》る"),
        ("雑巾絞り", "｜雑巾絞《ぞうきんしぼ》り"),
        ("零し", "｜零《こぼ》し"),
        ("疲労困憊", "｜疲労困憊《ひろうこんぱい》"),
        ("一瞥", "｜一瞥《いちべつ》"),
        ("佇ん", "｜佇《たたず》ん"),
        ("円な", "｜円《つぶら》な"),
        ("齧って", "｜齧《かじ》って"),
        ("品切重版未定", "｜品切重版未定《しなぎれじゅうはんみてい》"),
        ("憐れ", "｜憐《あわ》れ"),
        ("相応しい", "｜相応《ふさわ》しい"),
        ("皺を", "｜皺《しわ》を"),
        ("眉間", "｜眉間《みけん》"),
        ("頷く", "｜頷《うなず》く"),
        ## 用語解説用
        ("ただの編集者","ただの｜編《[1]》集者"),
        ("『異世界は衰退中です』", "｜『《[2]》｜異世界は衰退中です《イ　セ　ス　イ》』"),
        ("取次と", "｜取《[3]》次と"),
        ("担当している", "｜担《[4]》当している", ("二十人",)),
        ("編プロ時代から", "｜編《[5]》プロ時代から"),
        ("代表作は『日陰のアネモネ』", "代表作は｜『《[6]》日陰のアネモネ』"),
        ("芥川賞候補", "｜芥《[7]》川賞候補"),
        ("居留守を使う", "｜居《[8]》留守を使う"),
        ("約束の原稿を", "約束の｜原《[9]》稿を", ("顔合わせ",)),
        ("パイを投げつけるような", "｜パ《[10]》イを投げつけるような"),
        ("ライトノベルでは通常", "｜ラ《[11]》イトノベルでは通常"),
        ("だとヨンドルで読ん", "だと｜ヨ《[12]》ンドルで読ん"),
        ("品切重版未定。", "｜品《[13]》切重版未定。"),
        ("高浜虚子が小説を", "｜高浜《[14]たかはま》｜虚子《きょし》が小説を"),
        ("聞くとそれは小説家という", "聞くとそれは｜小《[15]》説家という"),
        ("『よく逃げ出すから", "｜『《[16]》よく逃げ出すから"),
        ("しかし携帯さえあれば", "しかし｜携《[17]》帯さえあれば"),
        ## 人名
        ("一宮沙奈", "｜一宮沙奈《いちみやさな》", ),
        ("深谷英里","｜深谷英里《ふかやえり》",),
        ("韮崎", "｜韮崎《にらさき》",),
        ("韮崎航大", "｜韮崎航大《にらさきこうだい》", ),
        ("大井景勝", "｜大井景勝《おおいかげかつ》", ),
        ("能登川修","｜能登川修《のとがわおさむ》",),
        ("能登川","｜能登川《のとがわ》",),
        ("修","｜修《おさむ》",),
        ("米沢耕作","｜米沢耕作《よねざわこうさく》",),
        ("西野成悟", "｜西野成悟《にしのせいご》"),
        ("綾部みさき", "｜綾部《あやべ》みさき"),
        )

LAYERS = (
        # Key / Title / Words
        )
