# -*- coding: utf-8 -*-
"""Story config.
"""

################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("sana", "沙奈", "一宮,沙奈", 24, (9,15), "female", "編集者", "me:私"),# 愛知県
        ("noto", "能登川", "能登川,修", 52, (6,14), "male", "作家", "me:僕"),# 石川県
        ## 出版社
        ("king", "大井", "大井,景勝", 50, (1,1), "male", "編集長", "me:俺", "あだ名は「王」"),# 神奈川県
        ("fukaya", "深谷", "深谷,英里", 35, (10,1), "female", "編集者", "me:わたし"),# 埼玉県
        )

STAGES = (
        # Tag / 名前 / 紹介
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        )

WORDS = (
        # Tag / 名前 / 紹介
        )

RUBIS = (
        # Base / Rubi / Type
        )

LAYERS = (
        # Key / Title / Words
        )
