# -*- coding: utf-8 -*-
"""Story config.
"""

################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("sana", "沙奈", "一宮,沙奈", 25, (9,15), "female", "編集者", "me:私"),# 愛知県
        ("noto", "能登川", "能登川,修", 52, (6,14), "male", "作家", "me:僕"),# 石川県
        ## 出版社
        ("king", "大井", "大井,景勝", 50, (1,1), "male", "編集長", "me:俺", "あだ名は「王」"),# 神奈川県
        ("fukaya", "深谷", "深谷,英里", 35, (10,1), "female", "編集者", "me:わたし"),# 埼玉県
        ("nirasaki", "韮崎", "韮崎,航大", 28, (1,1), "male", "編集者", "me:おれ"),# 山梨県
        ("tsuchiura", "土浦", "土浦,大樹", 22, (1,1), "male", "編集部バイト", "me:オレ"),# 茨城県
        ## 能登川関連
        ("tsuru", "敦賀", "敦賀,由紀夫", 52, (1,1), "male", "故人（作家見習い）", "me:オレ"),# 福井県／金閣寺の鶴田
        ("asahi", "朝日", "朝日,洋子", 52, (5,10), "female", "飲み屋", "me:アタシ"),# 富山県
        ("komi", "香美", "新村,香美", 52, (7,7), "female", "故人（学生）", "me:私"),# 兵庫県
        ## 沙奈関連
        ("gero", "下呂", "下呂,弥生", 19, (5,10), "female", "絵描き", "me:うち"),# 岐阜県
        ("azumino", "安曇野", "安曇野,三喜", 25, (1,10), "female", "作家見習い", "me:わたし"),# 長野県
        ("owase", "尾鷲", "尾鷲,孝之", 26, (7,1), "male", "作家志望", "me:オレ"),# 三重県
        ## 沙奈関連（家族）
        ("ken", "健一", "一宮,健一", 26, (11,5), "male", "会社員", "me:俺"),# 沙奈の兄
        ## 創作関連
        ("nose", "野迫川", "野迫川,卓斗", 35, (1,1), "male", "作家", "me:ボク"),# 奈良県　盗作作家
        ## 雑誌関連
        ("yuzawa", "湯沢", "湯沢,雅俊", 40, (6,25), "male", "記者", "me:俺"),# 新潟県　記者
        ## 編集プロ
        ("goto", "五島", "五島,風美", 40, (8,17), "female", "編集長", "me:私"),# 長崎県　前の会社の編集長
        )

STAGES = (
        # Tag / 名前 / 紹介
        ("Mitaka", "三鷹市", "多くの著名な作家が暮らした街として有名"),
        ("sta-mitakadai", "三鷹台駅", "先生のアパートの最寄り駅"),
        ("Nakano", "中野区", "東京23区の一つ。アリス出版がある"),
        ("sta-higashinakano", "東中野駅", "アリス出版の最寄り駅"),
        ("Nerima", "練馬区", "東京23区の一つ"),
        ("sta-kamishakujii", "上石神井駅", "沙奈たちのアパートの最寄り駅"),
        ("Kodansha", "王断社", "講談社がモデル。千代田区にある最大手の総合出版社"),
        ("Shueisha", "双鋭社", "集英社がモデル"),
        ("Shogakkan", "孔岳館", "小学館がモデル"),
        ("hercampany", "アリス出版", "沙奈の勤める会社。元々は児童書出版から始まった"),
        ("heroffice", "第二文芸部オフィス"),
        ("herhouse", "沙奈たちのシェアハウス"),
        ("herroom", "沙奈の部屋"),
        ("hisapart", "先生のアパート"),
        ("hisnewapart", "先生の新アパート"),
        ("hiscemetery", "敦賀の墓地"),
        ("hospital", "病院"),
        ("masterbar", "先生いきつけのバー"),
        ("mastercafe", "先生いきつけの喫茶店"),
        ("masterrestaurant", "先生いきつけの洋食屋"),
        ("tamagawariver", "玉川上水"),
        ("cafe", "喫茶店"),
        ("famires", "ファミレス"),
        ("artmuseum", "美術館"),
        ## 金沢
        ("Kanazawa", "金沢市", "先生の故郷"),
        ("hishome", "先生の実家"),
        ("oldfamires", "古いファミレス"),
        ## 城之崎
        ("Kinosaki", "城之崎", "温泉街として有名な街"),
        ("oldinn", "古い旅館"),
        ("onsen", "温泉"),
        ("dream", "夢の中"),
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        ("tsurudead", "敦賀が自殺した日", 6,13, 1997),
        ("firstmeet", "先生と初めて会った日", 10,2, 2017),
        ("deadline_short", "短編の原稿締切日", 10,30, 2017),
        ("meetingshortnovel", "短編掲載会議", 11,1, 2017),
        ("homevisit", "先生の実家に行った日", 1,2, 2018),
        ("back_kanazawa", "先生の実家から帰る日", 1,3, 2018),
        ("trip_kinosaki", "城之崎旅行", 1,7, 2018),
        ("backhome", "城之崎から戻ってきた日", 1,8, 2018),
        ("visitgrave", "墓参りの日", 1,13, 2018),
        ("threaten1", "第一の脅迫状が来た日", 1,15, 2018),
        ("visitmuseum", "美術館に行った日", 1,17, 2018),
        ("threaten2", "第二の脅迫状が来た日", 1,25, 2018),
        ("stalking", "ストーカーされた日", 1,26, 2018),
        ("holidaywriting", "休日に執筆日", 1,29, 2018),
        ("firemaster", "先生のアパート火事", 2,13, 2018),
        ("nextfire", "火事の翌日", 2,14, 2018),
        ("aftergetletter", "手紙を手に入れた後日", 2,16, 2018),
        ("readletter", "先生の手紙を読んだ日", 2,22, 2018),
        ("vanishmaster", "先生の失踪日", 2,23, 2018),
        ("finishbook", "原稿が上がった日", 2,28, 2018),
        ("getfirstbook", "先生の製本された本を手に取る", 3,15, 2018),
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        )

WORDS = (
        # Tag / 名前 / 紹介
        )

RUBIS = (
        # Base / Rubi / Type
        )

LAYERS = (
        # Key / Title / Words
        )
