# -*- coding: utf-8 -*-
"""Story config.
"""

################################################################
#
# Sample:
#
# 1) PERSONS
#       人物簡易設定
# 2) STAGES
#       舞台基本設定
# 3) DAYS
#       年月日設定
# 4) TIMES
#       時間帯基本設定
# 5) ITEMS
#       小道具設定
# 6) WORDS
#       辞書設定
# 7) RUBIS
#       ルビ設定
# 8) LAYERS
#       レイヤ設定
#
################################################################


PERSONS = (
        # Tag / 氏,名 / 歳 / 誕生日 / 性別 / 職業 / 呼称 / 紹介
        ("sana", "沙奈", "一宮,沙奈", 24, (9,15), "female", "編集者", "me:私"),# 愛知県
        ("noto", "能登川", "能登川,修", 52, (6,14), "male", "作家", "me:僕"),# 石川県
        ## 出版社
        ("king", "大井", "大井,景勝", 50, (1,1), "male", "編集長", "me:俺", "あだ名は「王」"),# 神奈川県
        ("fukaya", "深谷", "深谷,英里", 35, (10,1), "female", "編集者", "me:わたし"),# 埼玉県
        ## 能登川関連
        ("tsuru", "敦賀", "敦賀,由紀夫", 52, (1,1), "male", "故人（作家見習い）", "me:オレ"),# 福井県／金閣寺の鶴田
        ("asahi", "朝日", "朝日,洋子", 52, (5,10), "female", "飲み屋", "me:アタシ"),# 富山県
        ("komi", "香美", "新村,香美", 52, (7,7), "female", "故人（学生）", "me:私"),# 兵庫県
        ## 沙奈関連
        ("gero", "下呂", "下呂,弥生", 19, (5,10), "female", "絵描き", "me:うち"),# 岐阜県
        ("azumino", "安曇野", "安曇野,三喜", 25, (1,10), "female", "作家見習い", "me:わたし"),# 長野県
        ("owase", "尾鷲", "尾鷲,孝之", 26, (7,1), "male", "作家志望", "me:オレ"),# 三重県
        ## 沙奈関連（家族）
        ("ken", "健一", "一宮,健一", 26, (11,5), "male", "会社員", "me:俺"),# 沙奈の兄
        )

STAGES = (
        # Tag / 名前 / 紹介
        )

DAYS = (
        # Tag / 名前 / 月 / 日 / 年
        )

TIMES = (
        # Tag / 名前 / 時 / 分
        )

ITEMS = (
        # Tag / 名前 / 紹介
        )

WORDS = (
        # Tag / 名前 / 紹介
        )

RUBIS = (
        # Base / Rubi / Type
        )

LAYERS = (
        # Key / Title / Words
        )
